/*
 * dic_artist.h
 *
 *  Created on: 2017年4月25日
 *      Author: Jugo
 */

#pragma once

#include "container.h"

static set<string> setArtistTaiwan =
		create_set<string>("183club")("1976")("2moro")("3ep美少女")("4inLove")("4ever")("5566")("and")("ak")("algae")(
				"ASOS")("B.A.D")("Beauty4")("Breeze")("BY2")("Choc7")("Circus")("COLOR")("DmDm")("double2樂團")(
				"DreamGirls")("EGirls")("Energy")("F.I.R.")("F4")("紛紛樂團")("FIRE")("FUN4")("G.I.A")("Gentleman")("HERO")(
				"ing")("io樂團")("IPIS蟑螂合唱團")("JAM")("J.A.M")("JPM")("JS")("KONE")("Kangta&Vanness")("Kiss")("LABoyz")(
				"Lollipop@F")("Machi 麻吉")("MOJO")("MP魔幻力量")("OneFifth")("PopuLady")("Postm3n")("Q&A")("Roomie")("SHE")(
				"S.H.E")("SIGMA")("Soler")("SpeXial")("SpeXial")("StyLe")("SunLady")("SundayGirls")("Sweety")("T-Rush")(
				"Tension")("TizzyBac")("TOKYOD")("TopTwinz")("Twinko")("WeatherGirls")("WeatherGirls")("WEWE")("WHYNOT")(
				"WOW頭號人物")("X-Dream")("Y.I.Y.O")("Yummy")("ZERO+")("七朵花")("三片土司")("丘丘合唱團")("中國娃娃")("中堅份子")("丸子")("亂彈")(
				"五月天")("信樂團")("傻酷樂團")("優客李林")("元氣G-Boys")("元衛覺醒")("六甲樂團")("六翼天使")("冰淇淋少女組")("凡人二重唱")("刺客")("刺客合唱團")(
				"動力火車")("動靜樂團")("北原山貓")("南台灣小姑娘")("南拳媽媽")("南方二重唱")("可米小子")("台風")("同班同學二重唱")("咻比嘟嘩")("嘻哈甜心")(
				"HipHopHoneys")("四分衛")("四大天王")("城市少女")("夏卡毛樂團")("大台風樂團")("大嘴巴")("大囍門")("大小姐")("夾子電動大樂隊")("宇宙人")(
				"安妮朵拉樂團")("小虎隊")("少女隊")("展翼樂團")("展翼樂團 Zayin")("Zayin")("山風點伙")("強辯")("憂歡派對")("拜金小姐")("拾參樂團")("新寶島康樂隊")(
				"旺福")("昊恩家家")("星星月亮太陽")("星盒子")("景行廳男孩")("東城衛")("東方快車")("棉花糖 katncandix2")("櫻桃幫")("武虎將")("洛客班")("浩角翔起")(
				"浪花兄弟")("深白色二人組")("濁水溪公社")("火星熊樂團")("無印良品")("玖壹壹玖壹壹")("痞克四")("百合二重唱")("真女子樂團")("砰砰樂隊")("神木與瞳")("福茂女朋友")(
				"米兒絲 MYRS")("糯米團")("紅唇族")("紅孩兒")("紅螞蟻合唱團")("羅密歐")("翼勢力(Eastyle)")("脫拉庫")("自然捲")("自由發揮")("芝麻龍眼")("芭比BOB")(
				"范曉萱&100%樂團")("董事長樂團")("蒙恩使女 Blessed")("蘇打綠")("蜜雪薇琪")("豹小子")("超視覺風暴 (SVS)")("跳浪樂團")("辦桌二人組")("酷愛樂團")(
				"錦繡二重唱")("鐵竹堂")("閃亮三姐妹")("閃靈樂團")("閃靈")("阿妹妹")("阿爆&Brandy")("阿霈樂團")("青鳥飛魚")("非同小可")("音樂磁場")("飛輪海")(
				"魔幻1+1")("麵飽堡(MEMBOBOO)")("黑Girl")("包偉銘")("包小松")("包小柏")("包美聖")("鮑正芳")("包娜娜")("白光")("白冰冰")("白櫻")("白安")(
				"巴奈")("卜學亮")("白嘉莉")("畢國勇")("畢書盡")("邊品憲")("施碧")("潘裕文")("潘協慶")("潘安邦")("潘越雲")("潘美辰")("潘麗麗")("彭佳慧")("彭靖惠")(
				"彭立")("澎恰恰")("潘瑋儀")("馬兆駿")("馬玉芬")("馬萃如")("孟庭葦")("MCHotDog")("明道")("苗可麗")("鳳飛飛")("方宥心")("方文琳")("方季惟")(
				"方怡萍")("方瑞娥")("方炯鑌")("傅宇昊")("傅天穎")("傅振輝")("費玉清")("費翔")("馮皓")("馮小仕")("馮瑋君")("傅薇")("范逸臣")("范瑋琪")("范曉萱")(
				"范怡文")("東東")("丁衣凡")("丁小芹")("丁文琪")("丁薇")("丁噹")("丁曉雯")("鄧麗君")("戴佩妮")("戴愛玲")("黛安娜")("迪克牛仔")("鄧妙華")("豆花妹")(
				"鄧福如")("童安格")("陶喆")("陶大偉")("陶晶瑩")("陶莉萍")("同恩")("童童")("庹宗華")("庹宗康")("天心")("田希仁")("田馥甄")("Hebe")("田家達")(
				"唐文龍")("塗佩岑")("湯蘭花")("堂娜")("唐禹哲")("庭竹")("TANK")("倪安東")("鈕大可")("李宗盛")("李佳薇")("李傑宇")("李玟")("李聖傑")("李宣榕")(
				"李驥")("李茂山")("李壽全")("李李仁")("李亞明")("李心潔")("李雨寰")("李漫")("李千娜")("李建復")("李恕權")("李立崴")("李威")("李度")("李愛綺")(
				"李碧華")("李翊君")("李明依")("李麗芬")("李亭頤")("李炳輝")("李泰祥")("李亞萍")("李沛瑋")("黎沸揮")("黎礎寧")("廖大森")("林宥嘉")("林志炫")("林隆璇")(
				"林國榮")("林俊傑")("林志穎")("林育羣")("林佑威")("林健輝")("林宇中")("林強")("林生祥")("林東松")("林佳儀")("林凡")("林曉培")("林慧萍")("林芯儀")(
				"林心如")("林嘉欣")("林良樂")("林淑容")("林冠吟")("林依晨")("林雨宣")("林子娟")("林晏如")("林奐均")("林宜融")("凌峰")("林海")("林柏宏")("林欣甫")(
				"林金毛")("梁靜茹")("梁弘志")("梁文音")("梁一貞")("梁曉珺")("劉文正")("劉明峰")("劉秀暐")("劉畊宏")("劉明湘")("劉劭希")("劉艾立")("Erika")(
				"劉福助")("劉若英")("劉虹嬅")("劉虹翎")("劉軒蓁")("劉依純")("柳翰雅")("雷光夏")("羅百吉")("羅大佑")("羅志祥")("羅時豐")("羅美玲")("羅文裕")("路嘉欣")(
				"盧廣仲")("盧學叡")("藍心湄")("藍又時")("龍千玉")("龍飄飄")("龍劭華")("亂彈阿翔")("賴雅妍")("賴銘偉")("高凌風")("高明駿")("高慧君")("高山峰")(
				"高勝美")("高向鵬")("高泉志")("高淑津")("葛仲珊")("龔詩嘉")("郭一男")("郭品超")("郭子")("郭金發")("郭大誠")("郭桂彬")("郭美美")("郭采潔")("郭靜")(
				"郭婕祈")("高以愛")("關詩敏")("柯受良")("柯有倫")("柯庭燕")("柯以敏")("柯以柔")("康康")("康淨淳")("況明潔")("康禎庭")("黃舒駿")("黃大煒")("黃大軍")(
				"黃品源")("黃大城")("黃中原")("黃立行")("黃義達")("黃國倫")("黃名偉")("黃維德")("黃小琥")("黃嘉千")("黃小楨")("黃鶯鶯")("黃韻玲")("黃思婷")("黃玉榮")(
				"黃湘怡")("黃妃")("黃乙玲")("黃西田")("黃鴻升")("小鬼")("黃美珍")("黃連煜")("黃慧文")("黃雅珉")("黃仲崑")("黃立成")("黃文星")("黃靖倫")("何維健")(
				"何篤霖")("何嘉文")("何耀珊")("何以奇")("何欣穗")("胡瓜")("胡德夫")("洪一峰")("洪榮宏")("洪子涵")("洪第七")("侯德建")("侯湘婷")("霍正奇")("霍建華")(
				"賀一航")("荒山亮")("韓寶儀")("江蕙")("江淑娜")("江美琪")("江玲")("江蕾")("江明學")("江音")("江得勝")("金城武")("金瑞瑤")("金玉嵐")("金素梅")(
				"賈思樂")("金元萱")("季忠平")("紀曉君")("吉娃斯")("杜嵐")("甲子慧")("紀宏仁")("紀露霞")("江念庭")("季欣霈")("江語晨")("簡鳳君")("邱幸儀")("邱俐綾")(
				"邱芸子")("裘海正")("青山")("曲佑良")("齊秦")("齊豫")("邱澤")("秦楊")("千百惠")("錢幽蘭")("錢帥君")("徐佳瑩")("徐若瑄")("徐懷鈺")("徐婕兒")(
				"徐筱寧")("徐瑋")("西卿")("徐仲薇")("徐詠琳")("徐世珍")("徐紫琪")("許哲珮")("許景淳")("許石")("許紹洋")("許茹芸")("許慧欣")("許慧慧")("許淑絹")(
				"許雅涵")("許仁傑")("許志豪")("許嘉凌")("謝震廷")("謝雷")("謝坤達")("謝宇威")("謝宇書")("謝金燕")("謝麗金")("謝曜仲")("蕭瀟")("蕭薔")("蕭淑慎")(
				"蕭賀碩")("蕭煌奇")("蕭亞軒")("蕭敬騰")("蕭孋珠")("蕭閎仁")("熊美玲")("熊海靈")("辛曉琪")("辛隆")("薛岳")("弦子")("秀蘭瑪雅")("璽恩")("向蕙玲")(
				"周杰倫")("周定緯")("周納")("周傳雄")("周俊偉")("周渝民")("周蕙")("周子寒")("周佳佑")("周雅芳")("卓文萱")("卓依婷")("朱孝天")("朱安禹")("張宇")(
				"張雨生")("張洪量")("張洛君")("張克帆")("張信哲")("張震嶽")("張心傑")("張智成")("張善為")("張棟樑")("張峰奇")("張真")("張誌家")("張惠妹")("張清芳")(
				"張艾嘉")("張鳳鳳")("張韶涵")("張秀卿")("張懸")("張俐敏")("張芯瑜")("張元蒂")("張玉華")("張蓉蓉")("趙傳")("趙自強")("趙詠華")("趙之璧")("趙樹海")(
				"詹曼鈴")("詹雅雯")("詹雯婷")("詹芸")("鄭智化")("鄭進一")("鄭怡")("鄭華娟")("鄭朝方")("鄭日清")("鄭中基")("鄭新瑋")("豬哥亮")("豬頭皮")("甄秀珍")(
				"甄妮")("祝釩剛")("鄭麗絲")("莊明珠")("莊琇媛")("莊淑君")("張棋惠")("張綺倫")("張涵雅")("純純")("車志立")("陳達")("陳淑樺")("陳曼青")("陳綺貞")(
				"陳珊妮")("陳曉娟")("陳思安")("Chensuann")("陳譯賢")("陳明真")("陳嘉樺")("Ella")("陳美鳳")("陳亞蘭")("陳盈潔")("陳小雲")("陳小霞")("陳亮吟")(
				"陳以恩")("陳依依")("陳冠蒨")("陳嘉唯")("陳予新")("陳崴")("陳珂冰")("陳彥允")("陳艾湄")("陳艾玲")("陳建年")("陳志朋")("陳昇")("陳彼得")("陳樂融")(
				"陳國華")("陳奕")("陳信宏")("五月天")("陳熙")("陳雨霈")("陳柏全")("陳耀川")("陳冠蒲")("陳以生")("陳明章")("陳百潭")("陳一郎")("陳雷")("陳乃榮")(
				"陳偉聯")("陳勢安")("陳威全")("陳永淘")("陳樂軒")("陳芳語")("KimberleyChen")("施文彬")("施孝榮")("施易男")("石康鈞")("石喬")("沈簡單")(
				"沈芳如")("沈文程")("沈雁")("任潔玲")("任龍欣")("任家萱")("Selina")("任賢齊")("阮丹青")("芮恩")("曾靜玟")("曾沛慈")("曾寶儀")("曾淑勤")(
				"曾慶瑜")("曾心梅")("曾雅君")("左安安")("左光平")("曾詠熙")("蔡琴")("蔡依林")("蔡藍欽")("蔡榮祖")("蔡振南")("蔡旻佑")("蔡幸娟")("蔡秋鳳")("蔡健雅")(
				"蔡淳佳")("蔡詩蕓")("蔡小虎")("蔡麗津")("曹蘭")("曹格")("曹雅雯")("曹松章")("崔苔菁")("崔愛蓮")("孫燕姿")("孫自佑")("孫盛希")("孫碧娜")("孫淑媚")(
				"孫越")("孫協志")("蘇芮")("蘇來")("蘇慧倫")("蘇有朋")("蘇見信")("信")("蘇玉貝")("宋岳庭")("宋念宇")("阿弟仔")("阿福")("阿沁")("FIR")("阿桑")(
				"A-Lin")("阿吉仔")("阿杜")("阿BEN")("EasyShen")("愛愛")("歐陽菲菲")("歐得洋")("歐漢聲")("安伯政")("安琪")("安以軒")("安心亞")("楊宗緯")(
				"楊駿文")("楊永聰")("James")("楊耀東")("楊烈")("楊培安")("楊宗憲")("楊呈偉")("楊乃文")("楊丞琳")("楊林")("楊黎蘇")("游鴻明")("游喧")("殷正洋")(
				"葉秉桓")("葉瑋庭")("葉乃文")("葉佳修")("葉啟田")("葉璦菱")("葉蒨文")("葉良俊")("葉歡")("楊海薇")("姚若龍")("姚蘇蓉")("姚黛瑋")("楊昕曦")("楊韻禾")(
				"楊芳儀")("葉樹茵")("陽帆")("言承旭")("尤雅")("尤鳳")("尤卿")("尤君")("尤美")("銀霞")("顏志文")("顏華")("一帆")("依拜維吉")("伊能靜")("炎亞綸")(
				"嚴爵")("閻韋伶")("王詩安")("Diana")("王力宏")("王中平")("王宏恩")("王夢麟")("王柏森")("王馨平")("王儷婷")("OliviaOng")("王海玲")("王瑞瑜")(
				"王日昇")("王玉玲")("比莉")("王心凌")("王默君")("王羚柔")("王樂妍")("王菀之")("王芷蕾")("吳倩蓮")("吳晉淮")("王傑")("王識賢")("王建傑")("王開城")(
				"王明哲")("王瑞霞")("王傳一")("王若琳")("王翔")("伍思凱")("伍佰")("伍浩哲")("巫啟賢")("巫奇")("吳宗憲")("吳奇隆")("吳克群")("吳忠明")("吳德宏")(
				"吳佩珊")("吳立琪")("吳佩慈")("吳靜嫻")("吳淑敏")("吳辰君")("吳勇濱")("吳聽徹")("吳映潔")("鬼鬼")("汪佩蓉")("翁倩玉")("翁立友")("溫嵐")("文夏")(
				"吳鶯音")("吳尊")("韋禮安")("萬沙浪")("萬芳")("金智娟")("娃娃")("魏如萱")("魏如昀")("余天")("余皓然")("于櫻櫻")("于楓")("于台煙")("于冠華")(
				"于立成")("于浩威")("庾澄慶")("袁惟仁")("袁小迪")("袁泉")("袁詠琳")("永邦")("禹黎朔")("郁可唯")("元若藍");

static set<string> setArtistEnglish =
		create_set<string>("50 cent")("alicia keys")("andy gibb")("aretha franklin")("barbra streisand")(
				"barry manilow")("bee gees")("beyonce")("billy joel")("bobby darin")("bobby vinton")("bob seger")(
				"bon jovi")("boyz ii men")("brenda lee")("bruce springsteen")("bruno mars")("bryan adams")(
				"captain & tennille")("carpenters")("celine dion")("cher")("chicago")("chris brown")("chubby checker")(
				"commodores")("connie francis")("daryl hall john oates")("destiny's child")("diana ross")(
				"dionne warwick")("donna summer")("duran duran")("eagles")("elton john")("elvis presley")("eminem")(
				"fleetwood mac")("foreigner")("four tops")("george michael")("gladys knight and the pips")(
				"gloria estefan")("heart")("huey lewis & the news")("james brown")("janet jackson")("jay z")(
				"john denver")("john mellencamp")("justin timberlake")("kanye west")("katy perry")("kelly clarkson")(
				"kenny rogers")("kool & the gang")("lady gaga")("linda ronstadt")("lionel richie")("madonna")(
				"mariah carey")("maroon 5")("marvin gaye")("michael jackson")("neil diamond")("neil sedaka ")("nelly")(
				"olivia newton-john")("paula abdul")("paul anka")("paul mccartney")("phil collins")("p!nk")("prince")(
				"ray charles")("richard marx")("ricky nelson")("rihanna")("r. kelly")("rod stewart")("starship")(
				"stevie wonder")("taylor swift")("the 4 seasons")("the 5th dimension")("the beach boys")("the beatles")(
				"the black eyed peas")("the everly brothers")("the jacksons")("the miracles")("the pointer sisters")(
				"the rolling stones")("the supremes")("the temptations")("three dog night")("tlc")(
				"tony orlando & dawn")("usher")("whitney houston")("metallica")("x japan")("seikima")("megadeth")(
				"slayer")("iron maiden");
